In [2]:
import sqlite3

In [4]:
db = sqlite3.connect('IMDB.sqlite')

In [5]:
db

In [6]:
db = sqlite3.connect('school.sqlite')

In [7]:
db

In [8]:
cur = db.cursor()
cur

In [9]:
sql_query = 'create table student (rollnumber int primary key, name text, age int)'
cur.execute(sql_query)

In [11]:
cur.execute('insert into student values (101,"aman",20)')

In [12]:
db.commit()

In [13]:
cur.execute('insert into student values (102,"anuj",22)')

In [14]:
db.commit()

In [15]:
db.close()

In [16]:
import sqlite3

In [19]:
db = sqlite3.connect('employee.sqlite')

In [20]:
db

In [21]:
cur = db.cursor()

In [22]:
cur.execute('create table employee_detail (employee_id int primary key, name text,age int, department text, salary int )')

In [23]:
cur.execute('insert into employee_detail (employee_id,name,age,department,salary) values (100,"Rishav",25,"Marketing",50000),(101,"Abhishek",26,"operation",60000),(102,"aman",24,"human resource",75000)')

In [24]:
db.commit()

In [25]:
db.close()

In [26]:
db = sqlite3.connect('school.sqlite')

In [27]:
cur = db.cursor()

In [28]:
cur.execute('insert into student values (103,"mohit",24)')

In [29]:
db.commit()

In [30]:
rollnumber=104
name='nikhil'
age=34
# with help of variable we can add value
cur.execute('insert into student values ( ?,?,?)',(rollnumber,name,age))

In [31]:
db.commit()

In [32]:
values = [(105,"nidhi",20),(106,"manisha",21),(107,"ankush",22)]
cur.executemany('insert into student values (?,?,?)',values)

In [33]:
db.commit()

In [34]:
cur.execute('update student set age = 30')

In [36]:
db.commit()

In [37]:
cur.execute('update student set age = 20 where rollnumber = 102')

In [38]:
db.commit()

In [39]:
new_age = 50
cur.execute('update student set age= ? where rollnumber = 103',(new_age,))

In [40]:
db.commit()

In [43]:
cur.execute('delete from student where rollnumber = 104')

In [44]:
db.commit()

In [45]:
import sqlite3

db = sqlite3.connect('Employee_Detail.sqlite')
db
cur = db.cursor()
cur
sql_query = 'create table Employee_Detail(Employee_ID int primary key, Name text, Age int, Department text, Salary int )'
cur.execute(sql_query)
values = [(101, 'Aadarsh', 25, 'Marketing', 50000),(102, 'Aarti', 27, 'Operations', 60000),(103, 'Siddharth', 25, 'Finance', 85000)]
cur.executemany('Insert into Employee_Detail values (?,?,?,?,?)', values)
db.commit()
values = [(104, 'Aman', 24, 'Human Resource', 75000),(105, 'Amit', 30, 'Marketing', 50000),(106, 'Shivansh', 26, 'IT', 90000)]
cur.executemany('Insert into Employee_Detail values (?,?,?,?,?)', values)
db.commit()
values = [(107, 'Vaibhav', 23, 'Finance', 85000),(108, 'Himanshu', 26, 'IT', 90000),(109, 'Raman', 25, 'Operations', 60000)]
cur.executemany('Insert into Employee_Detail values (?,?,?,?,?)', values)
db.commit()
values = [(110, 'Kunal', 26, 'Marketing', 50000),(111, 'Adhira', 29, 'Human Resource', 75000),(112, 'Tanya', 24, 'Marketing', 50000)]
cur.executemany('Insert into Employee_Detail values (?,?,?,?,?)', values)
db.commit()
db.close()
print('Done')

Done

In [46]:
db.close()

In [47]:
db = sqlite3.connect('school.sqlite')
cur = db.cursor()

In [48]:
rollnumber=104
name='nikhil'
age=34
# with help of variable we can add value
cur.execute('insert into student values ( ?,?,?)',(rollnumber,name,age))

In [49]:
db.commit()

In [50]:
cur.execute('select * from student')

In [51]:
for row in cur:
    print(row)

(101, 'aman', 30)
(102, 'anuj', 20)
(103, 'mohit', 50)
(105, 'nidhi', 30)
(106, 'manisha', 30)
(107, 'ankush', 30)
(104, 'nikhil', 34)

In [52]:
cur.execute('select * from student')
cur.fetchone()

(101, 'aman', 30)

In [54]:
cur.execute('select * from student')
cur.fetchmany(3)

[(101, 'aman', 30), (102, 'anuj', 20), (103, 'mohit', 50)]

In [55]:
cur.execute('select * from student')
cur.fetchall()

[(101, 'aman', 30),
 (102, 'anuj', 20),
 (103, 'mohit', 50),
 (105, 'nidhi', 30),
 (106, 'manisha', 30),
 (107, 'ankush', 30),
 (104, 'nikhil', 34)]

In [57]:
cur.execute('select * from student where rollnumber > 103')
cur.fetchmany(3)

[(104, 'nikhil', 34), (105, 'nidhi', 30), (106, 'manisha', 30)]

In [58]:
cur.execute('select * from student where name like "a%"')
cur.fetchall()

[(101, 'aman', 30), (102, 'anuj', 20), (107, 'ankush', 30)]

In [59]:
db.close()

In [60]:
db = sqlite3.connect('Employee_Detail.sqlite')

In [61]:
cur = db.cursor()

In [66]:
cur.execute('select Employee_ID from Employee_Detail where Department = "Finance" ')

In [67]:
ans = cur.fetchall()
for i in ans:
    print(i[0])

103
107

In [68]:
cur.execute('select Department,count(*) from Employee_Detail group by Department')
ans = cur.fetchall()
for i in ans:
    print(i[0],i[1])
db.close()

Finance 2
Human Resource 2
IT 2
Marketing 4
Operations 2

In [69]:
import pandas as pd

In [70]:
db = sqlite3.connect('school.sqlite')

In [71]:
data = pd.read_sql_query("select * from student ",db)

In [72]:
data

   rollnumber     name  age
0         101     aman   30
1         102     anuj   20
2         103    mohit   50
3         105    nidhi   30
4         106  manisha   30
5         107   ankush   30
6         104   nikhil   34

In [73]:
 data['age']==30

0     True
1    False
2    False
3     True
4     True
5     True
6    False
Name: age, dtype: bool

In [74]:
data[ data['age']==30]

   rollnumber     name  age
0         101     aman   30
3         105    nidhi   30
4         106  manisha   30
5         107   ankush   30

In [77]:
data = pd.DataFrame([[201,"aman","eng",20000],[202,"bhavya","maths", 25000],[203,"anuj","science", 25000]],columns = ["id","name","course","salary"])

In [78]:
data

    id    name   course  salary
0  201    aman      eng   20000
1  202  bhavya    maths   25000
2  203    anuj  science   25000

In [79]:
data.to_sql("faculty",db)

3

In [83]:
data = pd.read_sql_query("select * from student ",db)
data["address"]="test"
data.to_sql("student",db,if_exists = "replace")

7

In [84]:
db.close()

In [85]:
db = sqlite3.connect('IMDB.sqlite')

In [86]:
data = pd.read_sql_query('select * from genre',db)

In [87]:
data

    Movie_id      genre
0      36809  Biography
1      30114  Adventure
2      37367     Comedy
3      49473     Comedy
4      14867      Drama
..       ...        ...
346    38262
347    10023     Comedy
348    27783     Sci-Fi
349    42294     Sci-Fi
350    32217     Comedy

[351 rows x 2 columns]

In [88]:
data = data[data['genre']!='']

In [89]:
data = data["genre"].value_counts()

In [90]:
data

Drama        77
Adventure    43
Action       33
Comedy       31
Biography    21
Sci-Fi       18
Thriller     14
Animation    13
Romance      13
Crime        11
Mystery       7
Fantasy       7
History       6
Family        3
Sport         3
Music         3
Western       2
War           2
Horror        2
Musical       1
Name: genre, dtype: int64

In [91]:
for i in range(len(data)):
    print(data.index[i],data.values[i])

Drama 77
Adventure 43
Action 33
Comedy 31
Biography 21
Sci-Fi 18
Thriller 14
Animation 13
Romance 13
Crime 11
Mystery 7
Fantasy 7
History 6
Family 3
Sport 3
Music 3
Western 2
War 2
Horror 2
Musical 1

In [92]:
data = pd.read_sql_query('select * from earning inner join IMDB on earning.Movie_id=IMDB.Movie_id',db)

In [93]:
data

,Movie_id,Domestic,Worldwide,Movie_id,Title,Rating,TotalVotes,MetaCritic,Budget,Runtime,...,Votes3044,Votes3044M,Votes3044F,Votes45A,Votes45AM,Votes45AF,VotesIMDB,Votes1000,VotesUS,VotesnUS
0,36809,56671993,1.877332e+08,36809,12 Years a Slave (2013),8.1,496092,96,20000000.0,134 min,...,8.0,7.9,8.0,7.8,7.8,8.1,8.0,7.7,8.3,8.0
1,30114,18335230,6.073880e+07,30114,127 Hours (2010),7.6,297075,82,18000000.0,94 min,...,7.5,7.5,7.5,7.3,7.3,7.5,7.6,7.0,7.7,7.6
2,37367,35014192,3.918778e+07,37367,50/50 (2011),7.7,283935,72,8000000.0,100 min,...,7.6,7.6,7.6,7.4,7.4,7.5,7.4,7.0,7.9,7.6
3,49473,15322921,8.710045e+07,49473,About Time (2013),7.8,225412,,12000000.0,123 min,...,7.6,7.6,7.7,7.6,7.5,7.8,7.7,6.9,7.8,7.7
4,14867,6739492,1.983949e+07,14867,Amour (2012),7.9,76121,94,8900000.0,127 min,...,7.7,7.7,7.9,7.9,7.8,8.1,6.6,7.2,7.9,7.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
112,38262,13092000,4.898204e+07,38262,Whiplash (2014),8.5,492285,88,3300000.0,107 min,...,8.3,8.3,8.2,8.1,8.1,8.2,8.7,8.0,8.6,8.4
113,10023,189422889,4.712229e+08,10023,Wreck-It Ralph (2012),7.7,295125,72,165000000.0,,...,7.6,7.6,7.7,7.4,7.4,7.5,7.4,7.2,7.9,7.6
114,27783,233921534,7.478628e+08,27783,X-Men: Days of Future Past (2014),8.0,560736,74,200000000.0,132 min,...,7.8,7.8,8.0,7.7,7.7,7.9,7.5,7.4,8.1,7.9
115,42294,146408305,3.536241e+08,42294,X-Men: First Class (2011),7.8,556713,65,160000000.0,132 min,...,7.7,7.6,7.8,7.6,7.5,7.7,7.6,7.3,7.8,7.7
116,32217,341268248,1.023784e+09,32217,Zootopia (2016),8.1,309474,78,150000000.0,108 min,...,7.8,7.8,8.1,7.8,7.8,8.1,7.7,7.6,8.0,8.0

In [95]:
data['total'] = data['Domestic']+data['Worldwide']
max1 = max(data["total"])
data = data[data['total']==max1]
print(data.values[0][5])

8.1